# Создать образ на основе базового слоя python (там будет ОС и интерпретатор Python).
# 3.7 — используемая версия Python.
# slim — обозначение того, что образ имеет только необходимые компоненты для запуска,
# он не будет занимать много места при развёртывании.
FROM python:3.10-slim

# Запустить команду создания директории внутри контейнера
RUN mkdir /gpt_bot

# Скопировать с локального компьютера файл зависимостей
# в директорию /app.
COPY requirements.txt /gpt_bot

# Выполнить установку зависимостей внутри контейнера.
RUN pip3 install -r /gpt_bot/requirements.txt --no-cache-dir

# Скопировать содержимое директории /api_yamdb c локального компьютера
# в директорию /app.
COPY ./ /gpt_bot

# Сделать директорию /app рабочей директорией. 
WORKDIR /gpt_bot

# Выполнить запуск сервера разработки при старте контейнера.
CMD ["python3", "./bot.py"]